app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
	def index
	    role = Role.find(@current_user.role_id)
	    if role.permissions[0] == '0'
	      redirect_to root_path
	    end
		@company = Company.find(@current_user.company_id)
		@search_par = params[:search]
		if @current_user.role == 'Manager'
			if @search_par == nil || @search_par == ''
				@projects = Project.where(:company_id => @company.id).order(:title)
			else
				@projects = Project.where('company_id = ? and title like ?', @company.id, '%' + @search_par + '%').order(:title)
			end
		else
			if @search_par == nil || @search_par == ''
				@projects = @current_user.projects.order(:title)
			else
				@projects = Project.where('id in(?) and title like ?', @current_user.projects.ids, '%' + @search_par + '%').order(:title)
			end
		end
		@lengths = {'projects' => @projects.length}

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
	    role = Role.find(@current_user.role_id)
	    if role.permissions[0] == '0'
	      redirect_to root_path
	    end
		@company = Company.find(@current_user.company_id)

		@milestone = Milestone.new
		@milestones = Milestone.where(:project_id => params[:id])
		@milestone_infos = Milestone.milestone_infos(@milestones)
		@tasks = Task.where(:project_id => params[:id], :company_id => @company.id)

		if ProjectUser.exists?(:project_id => params[:id], :user_id => @current_user.id) || @current_user.role == 'Manager'
			@users_in = ProjectUser.where(:project_id => params[:id]).collect(&:user)
			@table = ProjectUser.where(:project_id => params[:id]).collect(&:user_id)
			if @table.length > 0
				@users_sel = User.where('id NOT IN (?) and company_id = ?', @table, @company.id)
			else
				@users_sel = User.where(:company_id => @company.id)
			end
			@clients = User.where(:role => 'Client', :company_id => @company.id)
			@project = Project.find(params[:id])

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def edit
	    role = Role.find(@current_user.role_id)
	    if role.permissions[0].to_f % 2 == 0
	      redirect_to root_path
	    end
		@company = Company.find(@current_user.company_id)
		@clients = User.where(:role => 'Client', :company_id => @company.id)
		@project = Project.find(params[:id])

INSERT INTO "projects" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "MVC Project"], ["text", "Create Project"], ["created_at", "2017-07-05 08:24:57.985824"], ["updated_at", "2017-07-05 08:24:57.985824"]]
---
	def create
	    role = Role.find(@current_user.role_id)
	    if role.permissions[0].to_f % 2 == 0
	      redirect_to root_path
	    end
		@company = Company.find(@current_user.company_id)
		@clients = User.where(:role => 'Client', :company_id => @company.id)
		@project = Project.new(project_params)

		if @project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "projects" SET "text" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["text", "First: Create Project"], ["updated_at", "2017-07-05 09:57:39.818894"], ["id", 1]]
---
	def update
	    role = Role.find(@current_user.role_id)
	    if role.permissions[0].to_f % 2 == 0
	      redirect_to root_path
	    end
		@company = Company.find(@current_user.company_id)
		@project = Project.find(params[:id])
		@users = User.where('role != ? and company_id = ?', 'Client', @company.id)
		@user = User.find(params[:client])
		if !ProjectUser.exists?(:user => @user,:project => @project)
			ProjectUser.create({:user => @user, :project => @project})
		end

		if @project.update(project_params)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 2]]
---
	def destroy
	    role = Role.find(@current_user.role_id)
	    if role.permissions[0].to_f % 2 == 0
	      redirect_to root_path
	    end
		@company = Company.find(@current_user.company_id)
		@project = Project.find(params[:id])
		@project.destroy