app/controllers/sessions_controller.rb

  def profile
    @user = User.find(@current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]

  def login_attempt
  	authorized_user = User.authenticate(params[:username],params[:login_password])

  	if authorized_user
  		session[:user_id] = authorized_user.id
      if authorized_user.type != 'Superuser'
        role = Role.find(authorized_user.role_id)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", ""], ["LIMIT", 1]]