app/controllers/tasks_controller.rb

	def create
		@project = Project.find(params[:project_id])
		@task = @project.tasks.create(task_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tasks" ("title", "requirement", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Finish"], ["requirement", "Complete the project"], ["project_id", 1], ["created_at", "2017-07-05 12:26:56.029144"], ["updated_at", "2017-07-05 12:26:56.029144"]]

	def destroy
		@project = Project.find(params[:project_id])
		@task = @project.tasks.find(params[:id])
		@task.destroy
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."id" = ? LIMIT ?  [["project_id", 9], ["id", 2], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 2]]