app/controllers/users_controller.rb

  def update
  	@user = User.find(params[:id])

  	if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
UPDATE "users" SET "salt" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["salt", "$2a$10$xhVLjWweqbFOpQBG58QzTO"], ["encrypted_password", "$2a$10$xhVLjWweqbFOpQBG58QzTOzS/PPiiZTraFSs3fbE9vothzCcIxCzy"], ["updated_at", "2017-07-05 10:06:54.556984"], ["id", 21]]

  def create
  	@user = User.new(user_params)

  	if @user.save
---
INSERT INTO "users" ("username", "encrypted_password", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "aaaaa"], ["encrypted_password", "a"], ["role", "Employee"], ["created_at", "2017-07-05 08:46:09.201022"], ["updated_at", "2017-07-05 08:46:09.201022"]]